day11/02codeStreamFieldInitialization/codeStream_INIT/elliptical_IC/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    up
    {
        type            patch;
        nFaces          100;
        startFace       19800;
    }
    left
    {
        type            patch;
        nFaces          100;
        startFace       19900;
    }
    right
    {
        type            patch;
        nFaces          100;
        startFace       20000;
    }
    down
    {
        type            patch;
        nFaces          100;
        startFace       20100;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          20000;
        startFace       20200;
    }
)

// ************************************************************************* //
